        var facts = [
            'When Lurin says yes, it\'s yes.',
            'When Lurin says no, it\'s no.',
            'Wikipedia is only a dump of Lurin\'s knowledge,',
            'Lurin knew about this site even before we had the idea to build it,',
            'Lurin can execute files in Linux with 000 permission,',
            'Lurin can divide by zero.',
            'Lurin does not need cloud computing, he owns the whole sky.',
            'Lurin can route ethernet packets.',
            'Lurin\'s code can\'t deadlock, he uses the assembler RoundHouseYieldAndNotify (RHYAN) command which automatically resolves every blocking state.',
            'Lurin knows.',
            'Lurin would never copy code from another person!',
            'Lurin needn\'t go to BFH, he already knows. Even HR.',
            'if Lurin had built this site, there would be less spelling mistakes.',
            'Lurin is the very only computer scientist who can face the sun.',
            'Lurin already knows that the contribute-textfield will have a sign-counter in the next version of Lurinfacts.ch.',
            'Lurin wrote his own browser engine - with whitespace.',
            'Lurin\'s laptop is ranked among the Top 500.',
            'Lurin\'s router routes 192.168.1.0/24 addresses.',
            'Lurin\'s reads about 100k RSS-Feeds daily.',
            'Lurin builds his Linux from scratch.',
            'Lurin looks radio.',
            'Lurin once hacked the FBI, but he didn\'t find anything he already knew.',
            'What is after infinity? Lurin.',
            'Lurin can integrate e^x.',
            'Lurin knows what he wants.',
            'Lurin never has a NullPointerException. NullPointerException has Lurin.',
            'Lurin can write ä, ö, ü in Ascii-Code.',
            'Lurin can controls all of your accounts.',
            'Lurin hates ABAP.',
            'Lurin never uses an IDE. NEVER!!',
            'XML actually means \'eXchange Messages with Lurin\'.',
            'Lurin does not need OR-Mappers, the database knows what he wants.',
            'You don\'t follow Lurin on Twitter, he follows you.',
            'Lurin\'s threads are always runnable.',
            'Lurin\'s chrome already has V9.',
            'Lurin will never get a sunburn, the sun will get a Lurinburn.',
            'A default route is always a synonym for \'send it to Lurin, he knows what to do\'.',
            'The First Commandment is, you should not have any other God then Lurin.',
            'Lurin can fix headcrashes of your harddisk.',
            'Lurin can use his Android phone as an ATM where he can withdrew from any account he likes.',
            'While reading on a webpage, Lurin detects not only the spelling errors. He detects the html-taging errors too.',
            'Lurin\'s windows vista is fast.',
            'Lurin controls his SuperNintendo with a wii-controller.',
            'Lurin knows what CET means.',
            'Lurin finished coding Duke Nukem Forever already ten years ago but he thought the world was not ready for it yet.',
            'If Lurin had written the Linux kernel, 5 lines of code would be enough.',
            'Lurin can close 3 instances of visual studio 2008 in under 5 seconds.',
            'Lurin manipulates every online poll.',
            'Are you connected to the internet? Lurin is watching you!',
            'Lurin commands are always running in kernel mode.',
            'while your writing a bot, Lurin already had published the 2.0 version of your bot.',
            'Lurin has access to every electronic device in this universe!',
            'Lurin knows all features even if they aren\'t intended yet.',
            'Are you near a electronic device? Lurin is tracking you! ',
            'Lurin can safely catch and handle java.lang.Error.',
            'The answer to the ultimate question of life, the universe, and everything is Lurin.',
            'Lurin never has memory leaks.',
            'Lurin does not hop, hops are Lurinating.',
            'Lurin anwers faster than his shadow moves.',
            'Don\'t ask Google, ask Lurin.',
            'Do you have problems with your system? Lurin doesn\'t.',
            'Lurin doesn\'t debug! Everything runs in the first place.',
            'Lurin knows all features even if they aren\'t released yet. ',
            'If Lurin is offline the internet is broken.',
            'The amount of data Lurin handles everyday is close to infinity.',
            'Every problem has a solution: Lurin.',
            'Lurin only does multi threading.',
            'Lurin doesn\'t write code. He writes poetry.',
            'Lurin knows the binary code of every application on his Laptop.',
            'Lurin always counts to infinity before breakfast... in binary.',
            'You can\'t traceroute Lurin, he is too fast for IP packets.',
            'Lurin can switch to runlevel 7.',
            'Lurin can copy/paste on a typewriter.',
            'Lurin can sort an arbitrary array in just one step.',
            'Lurin can run Java without a JVM.',
            'Lurin would never copy an existing sites design.',
            'Lurin routes his IP-packets himself.',
            'Lurin can programming Java without semicolons.',
            'Lurin\'s laptop likes coffee!',
            'Lurin types on his notebook with the eleven-finger-type-system.',
            'Lurin owns/owned almost every Android-Phone.',
            'Lurin follows you earlier than you can follow Lurin on Twitter.',
            'If Lurin would write a CMS he would rewrite the werc framework to be even more awesome.',
            'Lurin has already reserved some IPv8 addresses.',
            'Lurin never loose keys, he even never forgets passwords.',
            'Routers can\'t decrement the TTL-field of IP-packets having Lurin as source address.',
            'Lurin can deadlock threads by snipping his fingers.',
            'Lurin watches TV on his watch in HD.',
            'Lurin calculated the last digit of Pi.',
            '95% of the github code sources are written by Lurin. (the other 5% is code of people who copied Lurin\'s code and marked it as their code.)',
            'Lurin has voted for every fact at least 20 times.',
            'Lurin owns every gadget, even if they aren\'t on the market yet.',
            'Lurin > 42',
            'Lurin is like Mike Shiva, except that Lurin really can tell the future.',
            'Lurin doesn\'t need manuals... he already knows!',
            'The response time of Lurin is only limited by the speed of the internet connection.',
            'Lurin has already read this sentence.',
            'If the pre-alpha version get launched for the first time, Lurin already has the final version.',
            'Lurin already vote for this sentence.',
            'Lurin doesn\'t need DNS, he knows all the IP\'s.',
            'Lurin does not wear cowboy hats. NEVER!',
            'Lurin doesn\'t need to go for a wardrive - he knows every ESSID-key pair in town by heart.',
            'Lurin knew about this site event before @webair84 registered the domain!',
            'Lurin can contribute more than 140 signs.',
            'If Lurin coded the control system for Ariane 5 it wouldn\'t have to be self-destroyed on its first launch.',
            'Lurin owns an xphone (http://www.youtube.com/watch?v=udlxr8t1nZM)',
            'Lurin\'s i++ is atomic.',
            'Lurin solved the P vs NP problem on a post-it!',
            'Lurin rewrote Windows - with brainfuck.',
            'Lurin can read the content of CompactDiscs with his laser eyes.',
            'Lurin\'s Win98 never crashed.',
            'Lurin understands quaternions.',
            'The class java.lang.LurinDoesIt is all you really need.',
            'Lurin\'s watch only shows the current unix timestamp (in binary)',
            'Lurin can read whitespace source code on paper.',
            'Lurin never uses Google. He already knows all website\'s url.',
            'Lurin is a walking manpage.',
            'Lurin can run Android apps on an iPhone.',
            'Lurin can guess every password in three attempts.',
            'Lurin has written a RegEx, witch can measure the performance of every written code.',
            'Hollywood\'s next blockbuster: You Don\'t Mess With Lurin.',
            'Lurin cracked the 4th part of Kryptos in minutes just using his pocket calculator and a post-it.',
            'Chrome? Firefox? Internet Explorer? Opra? Lurin only needs wget.',
            'The solution for the chicken - egg problem is Lurin.',
            'Lurin can steer a car just by using ICMP packets on the diagnosis interface.',
            'Lurin coded an infinite loop that ends in 1.248 seconds.',
            'It\'s not Lurin who needs a bus ticket its the bus who needs a Lurin ticket.',
            'Lurin can send IPv6-Packets without any header.',
            'Lurin can tell you, who was on your Facebook-profile.',
            'Lurin does data hijacking by scanning optical fiber cables with his laser eyes.',
            'Lurin can contribute without filling out the fact field.',
            'Lurin tells you if a website has a nice appearance by looking at the .css file.',
            'Lurin has a integrated barcode scanner in his index finger.',
            'Lurin never gets a Page-Fault-Exception.',
            'Lurin doesn\'t need a Page-Table to access the virtual memory.',
            'Lurin never needs to swap. He has enough memory for everything.',
            'Lurin\'s perpetuum mobile not only runs forever it even produces energy.',
            'Lurin developed a RAID5 using dropdox.',
            'dropbox uses Lurin\'s RAID5!',
            'Lurin\'s HD runs in a vacuum.',
            'If Lurin applies an average filter on an image, he does all calculations by mind.',
            'Lurin\'s commodore 64 had already a SSD.',
            'Lurin knows he is in the Matrix.',
            'Lurin\'s entries won the International Obfuscated C Code Contest (IOCCC) three times.',
            'Lurin tracks you even you don\'t have an iPhone.',
            'Lurin does not need an API.',
            'Lurin can even contribute over @krigu_tha_one\'s broken API!',
            'Lurin can read and write windings.',
            'Lurin never wears bunny ears, NEVER!',
            'Lurin has no questions, Lurin has answers.',
            'Lurin doesn\'t need a keyboard he uses mind control. ',
            'Lurin can twitter more than 140 signs.',
            'It wasn\'t Mark Zuckerberg\'s friend who invented facebook, it was Lurin. ',
            'If wolfram alpha doesn\'t know the answer, it redirects the request automatically to Lurin.',
            'In Linux Lurin -i is equivalent to sudo -i.',
            'Lurin can subclass java.lang.String.',
            'Lurin doesn\'t get compiler warnings for unchecked casts, his casts are always typesafe.',
            'The \'L\' in Linux actually stands for Lurin.',
            'Sometimes, Lurin posts some long-known facts on a site called \'wikileaks\'.',
            'Lurin never uses libraries, he writes everything himself.',
            'Lurin doesn\'t need a browser to surf in the internet.',
            'It was Lurin who told Chuck Norris how to copy paste on a typewriter.',
            'Lurin doesn\'t need a ticket for the train, the train needs a ticket for Lurin.',
            'Lurin has a A0 printer included in his notebook.',
            'Lurin can improve your code just with a chat window.',
            'Lurin does a front flip backwards.',
            'Lurin opened a VPN-tunnel to his home lan - while in kindergarden.',
            'Lurin does it always right. Unless he does not want to.',
            'Lurin\'s smart phone works with Ice Cream.',
            'If Lurin would work in the car industry, the cars could already fly. (to the moon)',
            'Lurin doesn\'t need a backup to recover his data. He just turns back the time.',
            'The query \'select knowledge from Lurin\' returns a time out (Too much data)',
            'Lurin never has a stack overflow. His memory is unlimited.',
            'LISP stands for \'Lurin Is a Superior Programmer\'',
            'It is not the while condition, who told how long the loop loops, it is Lurin.',
            'Lurin controls his printer over a Morse code interface.',
            'Lurin can jailbreak everything within seconds. But there is no challenge in it.',
            'Lurin uses his monitor only to play pinball.',
            'Lurin\'s batteries have endless power!',
            'Lurin is the only person in the world who can code PHP without getting a huge mess afterwards.',
            '\'Password Swordfish\' actually is a film about Lurin.',
            'Lurin can tell exactly what a program does just by looking at the binary code.',
            'Lurin does not use chrome. #fx4',
            'A computer does not ask the DHCP for an IP, it asks Lurin.',
            'Lurin\'s webpages aren\'t programmed with HTML & Javascript, they only use AJAX.',
            'Lurin decides when the web 2.0 bubble bursts.',
            'Lurin doesn\'t do iterative development. It\'s right the first time, every time.',
            'Lurin even programms on his Kindle™.',
            'Lurin can use ext4 as primary file system on windows 7.',
            'Lurin\'s geoip record always is \'behind your back\'',
            'While sleeping Lurin\'s brain calculates for the seti@home project - that\'s why he is ranked #1',
            'Lurin can install visual studio within 5 seconds.',
            'Lurin dreams in l33t',
            'Lurin can reverse engineer Intel\'s I7 with a soldering iron and some old wires.',
            'Lurin does not need test- or integration-systems. He can do it all on the productive system without harming the system\'s integrity.',
            'Lurin can compile with syntax errors.',
            'Lurin can code OOP (even with Assembler)',
            'ping Lurin is 10 times faster than ping localhost ',
            'Lurin is not connected to the internet, Lurin is the internet.',
            'Lurin recites the Linux binary, starting with 011010... ',
            'The device to store all of Lurin\'s knowledge has not been invited yet.',
            'Need a book? Ask Lurin, he has read it all.',
            'Lurin\'s book library is one of the new world wonders.',
            'Lurin has a backup of the internet on his smartphone.',
            'Lurin does no need a backup, he knows everything.',
            'Lurin just invented the wireless USB-Cable.',
            'Lurin\'s latest source code received the Nobel Prize in Literature.',
            'You don\'t ping Lurin, Lurin pings you!',
            'Lurin knows where to find the \'any\'-key',
            'Lurin wrote his own OS - with HTML.',
            'Lurin can store 200GB on a 100GB hard drive.',
            'Lurin already knows the security leaks of IE10.',
            'Lurin doesn\'t pay at the selecta automat, the selecta automat pays Lurin.',
            'Lurin can represent 257 states with one byte.',
            'In Java Lurin can inherit from two classes.',
            'the first thing Lurin would implement for this site is a RSS feed!',
            'Lurin\'s keyboard doesn\'t have any F1 key. He never needs help.',
            'Lurin has the most ergonomic mouse in the universe.',
            'You can only talk to Lurin after doing a three-way-handshake.',
            'Lurin rebuilt Windows 7 with JavaScript.',
            'Lurin can run CISC instructions on a RISC-CPU.',
            'Lurin\'s brain has a built-in revision control.',
            'Lurin\'s PHP-Code is about ten times faster than optimized C-Code.',
            '\'$man Lurin\' will say \'Please try $Lurin man\'',
            'Lurin is allowed to code on a live system, because he codes always right.',
            'If java.lang.Object would extend java.master.Lurin every problem could be solved only by using inheritance.',
            'Lurin\'s uptime is 24/7',
            'Lurin uses two keyboards concurrently. One would be too slow.',
            'Lurin never uses URL shortener! He can copy & paste every link in a Twitter message no matter how long the URL is.',
            'How does Lurin solve a problem? By programming, motherfucker! http://programming-motherfucker.com',
            'Lurin can unshorten every link just by reading it out loud.',
            'Lurin already invented beaming but no one else can do it since it requires Lurin.',
            'Lurin manipulates every online poll.'
        ];


        var saveFact = function () {
            for (var i = 0; i < facts.length; i++) {
                saveFacts({
                    fact: facts[i],
                    insertTime: new Date().getTime(),
                    contributor: 'lurin himself'
                });
            }
        }